tap "AdoptOpenJDK/openjdk"
tap "homebrew/cask-fonts"
tap "romkatv/powerlevel10k"

brew "gh"
brew "git"
brew "go"
brew "htop"
brew "jq"
brew "kubernetes-helm"
brew "n"
brew "nats-server"
brew "neovim"
brew "node"
brew "pipenv"
brew "python"
brew "reattach-to-user-namespace"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "tig"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "adoptopenjdk11"
cask "alfred"
cask "caffeine"
cask "discord"
cask "docker"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "lens"
cask "slack"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
